#include "usart.h"
#include "exfuns.h"
#include "sdio_sdcard.h"
#include "adc.h"
#include "Light_App.h"

Light_TypeDef LightSensor;

//********************************************************************************************
// * @brief       光照传感器初始化函数
// * @note	      本函数用于初始化光照传感器
// * @param       无
// * @retval      无
//********************************************************************************************
void Light_Init(void)
{	

}

//********************************************************************************************
// * @brief       光照传感器读取函数
// * @note	      本函数用于读取光照传感器的数值
// * @param       无
// * @retval      无
//********************************************************************************************
void Light_Read(void)
{
	LightSensor.light_value = adc_get_result(ADC_ADCX_CHY);
}

